In [ ]:
import numpy as np
import pandas as pd

In [ ]:
data=pd.read_csv('C:/Users/bodak/OneDrive/Рабочий стол/adult.data.csv.txt')
data.head()

In [ ]:
data['Age'].value_counts()

In [ ]:
data[data['sex']=='Female'].mean()

In [10]:
data[data['native-country']=='Germany'].describe()

,age,fnlwgt,education-num,capital-gain,capital-loss,hours-per-week
count,137.000000,137.000000,137.000000,137.000000,137.000000,137.000000
mean,39.255474,189325.313869,10.985401,887.094891,77.978102,41.014599
std,12.962065,100809.067728,2.370112,3627.385181,371.502899,12.328223
min,18.000000,21306.000000,4.000000,0.000000,0.000000,6.000000
25%,29.000000,116391.000000,9.000000,0.000000,0.000000,40.000000
50%,36.000000,178322.000000,10.000000,0.000000,0.000000,40.000000
75%,47.000000,231604.000000,13.000000,0.000000,0.000000,50.000000
max,74.000000,606111.000000,16.000000,27828.000000,1977.000000,70.000000

In [11]:
data['native-country'].describe()

count             32561
unique               42
top       United-States
freq              29170
Name: native-country, dtype: object

In [12]:
137/32561

0.004207487485028101

In [16]:
data[data['salary']=='>50K'].describe()

,age,fnlwgt,education-num,capital-gain,capital-loss,hours-per-week
count,7841.000000,7.841000e+03,7841.000000,7841.000000,7841.000000,7841.000000
mean,44.249841,1.880050e+05,11.611657,4006.142456,195.001530,45.473026
std,10.519028,1.025418e+05,2.385129,14570.378951,595.487574,11.012971
min,19.000000,1.487800e+04,2.000000,0.000000,0.000000,1.000000
25%,36.000000,1.191010e+05,10.000000,0.000000,0.000000,40.000000
50%,44.000000,1.761010e+05,12.000000,0.000000,0.000000,40.000000
75%,51.000000,2.309590e+05,13.000000,0.000000,0.000000,50.000000
max,90.000000,1.226583e+06,16.000000,99999.000000,3683.000000,99.000000

In [17]:
data[data['salary']=='<=50K'].describe()

,age,fnlwgt,education-num,capital-gain,capital-loss,hours-per-week
count,24720.000000,2.472000e+04,24720.000000,24720.000000,24720.000000,24720.000000
mean,36.783738,1.903409e+05,9.595065,148.752468,53.142921,38.840210
std,14.020088,1.064823e+05,2.436147,963.139307,310.755769,12.318995
min,17.000000,1.228500e+04,1.000000,0.000000,0.000000,1.000000
25%,25.000000,1.176060e+05,9.000000,0.000000,0.000000,35.000000
50%,34.000000,1.794650e+05,9.000000,0.000000,0.000000,40.000000
75%,46.000000,2.390230e+05,10.000000,0.000000,0.000000,40.000000
max,90.000000,1.484705e+06,16.000000,41310.000000,4356.000000,99.000000

In [61]:
d={'Bachelors':0, 'Prof-school':0, 'Assoc-acdm':0, 'Assoc-voc':0, 'Masters:0,Doctorate':0}
data[(data['salary']=='>50K') & (data['education']==d)].describe()

       age  fnlwgt  education-num  capital-gain  capital-loss  hours-per-week
count  0.0     0.0            0.0           0.0           0.0             0.0
mean   NaN     NaN            NaN           NaN           NaN             NaN
std    NaN     NaN            NaN           NaN           NaN             NaN
min    NaN     NaN            NaN           NaN           NaN             NaN
25%    NaN     NaN            NaN           NaN           NaN             NaN
50%    NaN     NaN            NaN           NaN           NaN             NaN
75%    NaN     NaN            NaN           NaN           NaN             NaN
max    NaN     NaN            NaN           NaN           NaN             NaN

In [62]:
data[data['salary']=='>50K']['education'].value_counts()

Bachelors       2221
HS-grad         1675
Some-college    1387
Masters          959
Prof-school      423
Assoc-voc        361
Doctorate        306
Assoc-acdm       265
10th              62
11th              60
7th-8th           40
12th              33
9th               27
5th-6th           16
1st-4th            6
Name: education, dtype: int64

In [64]:
data[data['race']=='Amer-Indian-Eskimo'].max()

age                               82
workclass                  State-gov
fnlwgt                        445168
education               Some-college
education-num                     16
marital-status               Widowed
occupation          Transport-moving
relationship                    Wife
race              Amer-Indian-Eskimo
sex                             Male
capital-gain                   27828
capital-loss                    1980
hours-per-week                    84
native-country         United-States
salary                          >50K
rich                            True
dtype: object

In [65]:
data[data['salary']=='>50K']['marital-status'].value_counts()

Married-civ-spouse       6692
Never-married             491
Divorced                  463
Widowed                    85
Separated                  66
Married-spouse-absent      34
Married-AF-spouse          10
Name: marital-status, dtype: int64

<=50K    60
>50K     25
Name: salary, dtype: int64

In [76]:
25/60

0.4166666666666667

In [77]:
data['hours-per-week'].max()

99

In [78]:
data[data['hours-per-week']==99].describe()

,age,fnlwgt,education-num,capital-gain,capital-loss,hours-per-week
count,85.000000,85.000000,85.000000,85.000000,85.000000,85.0
mean,43.517647,161462.129412,10.611765,799.529412,125.717647,99.0
std,13.339533,103387.089190,3.415978,2932.860012,508.916838,0.0
min,19.000000,24790.000000,4.000000,0.000000,0.000000,99.0
25%,34.000000,89681.000000,9.000000,0.000000,0.000000,99.0
50%,42.000000,158712.000000,10.000000,0.000000,0.000000,99.0
75%,51.000000,208826.000000,13.000000,0.000000,0.000000,99.0
max,90.000000,511289.000000,16.000000,15024.000000,2415.000000,99.0

In [79]:
data[data['hours-per-week']==99]['salary'].value_counts()

<=50K    60
>50K     25
Name: salary, dtype: int64

In [89]:
data['poor']=data[data['salary']=='<=50K']['hours-per-week']

In [90]:
data['not_poor']=data[data['salary']=='>50K']['hours-per-week']

In [91]:
data[data['native-country']=='Japan']['not_poor'].mean()

47.958333333333336

In [92]:
data[data['native-country']=='Japan']['poor'].mean()

41.0